let numbers = [
    6n,
    28n,
    496n,
    8128n,
    33550336n,
    8589869056n,
    137438691328n,
    2305843008139952128n,
    2658455991569831744654692615953842176n,
    191561942608236107294793378084303638130997321548169216n
  ];
let input = BigInt(prompt("Введите положительное целое число"));
for (i=0;i<numbers.length;i++) {
  if (input == numbers[i]) {
    f = 1;
    break;
  } else {
    f = 0
  }
}
if (f) {
  alert(`Число ${input} совершенное`);
} else {
  alert(`Число ${input} несовершенное`);
}